{
  "backend/main.mo": "Motoko actor defining a product catalog with luxury, vintage, and dupe categories, providing functions to add products and query them by name, category, or retrieve all products.",
  "feature_evidence.json": "Feature evidence report documenting the replacement of 'using Caffeine.ai' with 'by Nav' in the Footer component, linking to test ID REQ-48.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing components, hooks, and configuration for a luxury fashion e-commerce site with gold/black theming.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining a luxury color palette and design tokens for light and dark themes using oklch color space.",
  "frontend/index.html": "HTML entry point for the LuxeLogic application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component orchestrating the page layout with loading screen, header, hero, multiple product showcases, section dividers, about section, and footer.",
  "frontend/src/components/About.tsx": "About section component featuring brand mission text, statistics grid, gold-bordered image, and fade-in scroll animation with error handling.",
  "frontend/src/components/CollectionsShowcase.tsx": "Product showcase component filtering and displaying luxury and vintage products with featured imagery, loading skeletons, error handling, and fade-in animations.",
  "frontend/src/components/DupeCollections.tsx": "Refined alternatives section component filtering and displaying dupe category products with softer gold styling, featured imagery grid, and fade-in scroll effects.",
  "frontend/src/components/Footer.tsx": "Footer component with fade-in animation displaying LuxeLogic branding, navigation links (Collections, Refined Alternatives, About), and copyright information with three-column grid layout.",
  "frontend/src/components/Header.tsx": "Fixed header component with LuxeLogic logo and navigation menu featuring animated underline hover effects for Collections, Refined Alternatives, and About links.",
  "frontend/src/components/Hero.tsx": "Full-screen hero section with animated gold light streaks, background image with gradient overlay, and centered heading \"Curated Luxury. Timeless Power.\" with call-to-action button.",
  "frontend/src/components/LoadingScreen.tsx": "Full-screen loading overlay displaying animated \"LL\" monogram that fades out when loading completes.",
  "frontend/src/components/MenswearShowcase.tsx": "Menswear showcase section with asymmetric grid layout displaying product images in various sizes, featuring \"Timeless Elegance\" heading and descriptive text about luxury menswear collection.",
  "frontend/src/components/SectionDivider.tsx": "Decorative section divider component with background image, gold borders, and optional centered text overlay for visual separation between page sections.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages backend actor creation with Internet Identity authentication, automatically invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useFadeInOnScroll.ts": "Custom hook using IntersectionObserver to trigger fade-in animations when elements scroll into viewport with configurable threshold.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useProducts.ts": "React Query hook that fetches all products from the backend actor, enabled only when actor is available and not fetching.",
  "frontend/src/index.css": "Global CSS file defining a luxury dark theme with deep matte black (#0B0B0B) and metallic gold (#C6A75E) color palette, custom utility classes for gold glows, shadows, gradients, and animations, plus Tailwind directives and Google Fonts imports for Playfair Display and Inter.",
  "frontend/src/main.tsx": "Application entry point that renders the React app with QueryClient and InternetIdentityProvider wrappers for state management and authentication.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors mapped to CSS variables, luxury-themed shadows, custom spacing, Playfair Display and Inter font families, and plugins for animations and typography.",
  "project_state.json": "Project state document describing LuxeLogic as a luxury fashion brand website with dark villainous aesthetic, curated collections including 'Refined Alternatives' dupes, and existing features for hero section, collections showcase, about section, and dark theme implementation."
}